app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Joe"], ["last_name", "Bitch"], ["email", "poop@poop.com"], ["created_at", "2017-08-10 22:04:29.389363"], ["updated_at", "2017-08-10 22:04:29.389363"]]
---
  def create
    @user = User.new(user_params)
    if @user.save